def xmas_tree(n):
    #ทำส่วนหัวของต้น แต่ต้องมีการคูณช่องว่างไปด้วย
    xmas = '\n'
    xmas += (' '*(n + 4) + '|\n')
    xmas += (' '*(n + 2) + '--*--\n')
    xmas += (' '*(n + 3) + '/|\\\n')
    xmas += (' '*(n + 2) + '/* *\\\n')
    xmas += (' '*(n + 1) + '/* * *\\\n')
    xmas += (' '*(n) + '/* * * *\\\n')
    xmas += (' '*(n -1) + '/* * * * *\\\n')

    #ทำส่วนกลางของต้น * เริ่มจาก 2 แล้วปิดท้ายด้วย /* .... *\
    k = 2
    for i in range(n-1):
        for j in range(3):
            xmas += (' '*(n + 2 - j - k) + '/* ' + '* '*(k + j) + '*\\\n')
        k += 1

    #ทำส่วนฐานของต้น ตัว_ต้องคูณตาม n ด้วย
    xmas += (' '*(n + 3) + '|||\n')
    xmas += ('_'*(n + 3) + '|||' +'_'*(n + 3))
    return xmas

  
def main():
    n = int(input('Input n: '))
    print(xmas_tree(n))
    
if __name__ == '__main__':
    main()

#630510647
#สุทธิพันธ์ ประนันแปง
#002
#Lab07_EX1
